Tekla.Structures.Geometry3d.Polycurve.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.ICurve})
Constructs a geometry list from a list of geometries. This offers high degree of control over the creation.
geometryList: List of geometries to be applied

Tekla.Structures.Geometry3d.Polycurve.#ctor
Creates an empty geometry list

Tekla.Structures.Geometry3d.Polycurve.#ctor(Tekla.Structures.Geometry3d.ICurve)
Constructs a polycurve from a curve geometry
geometry: Initial geometry for the polycurve

Tekla.Structures.Geometry3d.Polycurve.#ctor(Tekla.Structures.Geometry3d.PolyLine)
Constructs a polycurve from a Tekla.Structures.Geometry3d.PolyLine. The lines are converted to line segments.
polyLine: Initial geometry for the geometry list